Дневник_трейдера/src/Documents/ДвижениеДенежныхСредств/ДвижениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ОстаткиДенежныхСредств</registerRecords>
  <attributes>
    <name>БрокерскийСчет</name>
    <type>
      <types>CatalogRef.БрокерскиеСчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзмененияОстатковДенежныхСредств</name>
    <attributes>
      <name>ДатаВремяСделки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаИзменения</name>
      <type>
        <types>EnumRef.ПричиныИзмененияОстатковДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дневник_трейдера/src/AccumulationRegisters/ОстаткиДенежныхСредств/ОстаткиДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиДенежныхСредств</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПричинаИзменения</name>
    <type>
      <types>EnumRef.ПричиныИзмененияОстатковДенежныхСредств</types>
    </type>
  </attributes>
  <dimensions>
    <name>БрокерскийСчет</name>
    <type>
      <types>CatalogRef.БрокерскиеСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дневник_трейдера/src/Enums/ПричиныИзмененияОстатковДенежныхСредств/ПричиныИзмененияОстатковДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныИзмененияОстатковДенежныхСредств</name>
  <enumValues>
    <name>ВыводСБрокерскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаКупонов</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>ОбменВалютыПоступление</name>
  </enumValues>
  <enumValues>
    <name>ОбменВалютыСписание</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеОблигации</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаЦеннойБумаги</name>
  </enumValues>
  <enumValues>
    <name>ПополнениеБрокерскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПродажаЦеннойБумаги</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеНалога</name>
  </enumValues>
</mdclass:Enum>

Дневник_трейдера/src/Documents/ДвижениеДенежныхСредств/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр ОстаткиДенежныхСредств 
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	Для Каждого ТекСтрока Из ИзмененияОстатковДенежныхСредств Цикл
		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		Движение.ВидДвижения = ОпределитьВидДвижения(ТекСтрока.ПричинаИзменения);
		Движение.Период = ТекСтрока.ДатаВремяСделки;
		Движение.БрокерскийСчет = БрокерскийСчет;
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьВидДвижения(ПричинаИзменения)
	
	Если ПричинаИзменения = Перечисления.ПричиныИзмененияОстатковДенежныхСредств.ПополнениеБрокерскогоСчета
	ИЛИ ПричинаИзменения = Перечисления.ПричиныИзмененияОстатковДенежныхСредств.ВыплатаКупонов
	ИЛИ ПричинаИзменения = Перечисления.ПричиныИзмененияОстатковДенежныхСредств.ПогашениеОблигации
	ИЛИ ПричинаИзменения = Перечисления.ПричиныИзмененияОстатковДенежныхСредств.ОбменВалютыПоступление
	Тогда
		Возврат ВидДвиженияНакопления.Приход;
	Иначе
		Возврат ВидДвиженияНакопления.Расход;
	КонецЕсли;		
	
КонецФункции
	
#КонецОбласти

#КонецЕсли
